---
type: ProjectLocationSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ProjectLocationSet

`Autodesk.Revit.DB.ProjectLocationSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ProjectLocationSet | — | `public ProjectLocationSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( ProjectLocation item )` |
| Method | Erase | — | `public virtual int Erase ( ProjectLocation item )` |
| Method | ForwardIterator | — | `public virtual ProjectLocationSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( ProjectLocation item )` |
| Method | ReverseIterator | — | `public virtual ProjectLocationSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |